bases/Wim_Du/projects/IMDEV-9101 Перевод ДС на биржу/Расширения/IMDEV9101_cfe/Documents/ПлатежноеПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ПлатежноеПоручение</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Поручение</v8:Type>
						<v8:Type>cfg:DocumentRef.КонвертацияВалюты</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеВознаграждения</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеПроцентовОтСреднейСЧА</v8:Type>
						<v8:Type>cfg:DocumentRef.ОперацияБух</v8:Type>
						<v8:Type>cfg:DocumentRef.НачислениеЗадолженности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Document>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-9101 Перевод ДС на биржу/Расширения/IMDEV9101_cfe/Enums/ВидыОперацийПоручение.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<ObjectBelonging>Adopted</ObjectBelonging>
			<Name>ВидыОперацийПоручение</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>Перевод</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<ObjectBelonging>Adopted</ObjectBelonging>
					<Name>ВыводИзДУ</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

bases/Wim_Du/projects/IMDEV-9101 Перевод ДС на биржу/Расширения/IMDEV9101_cfe/Documents/ПлатежноеПоручение/Ext/ObjectModule.bsl
// IMDEV-9101
// Описание: Быстрый путь статусов при массовом создании ПП розничного ДУ.
// Убирает дублирующие чтения ИсторияСтатусовОбъектов (Q1-Q5), сохраняет записи W1/W2.
// Флаги в ДополнительныеСвойства выставляет EPF/ERF (внСинхронизацияНСИ / внТестППРозничногоДУ).

#Область IMDEV9101_МассовоеСозданиеППРДУ

// IMDEV-9101
// Описание: Признак массового режима РДУ по флагам ДополнительныеСвойства и типу основания.
//
// Возвращаемое значение:
//  Булево - Истина, если включён быстрый путь статусов
//
Функция IMDEV9101_ЭтоМассовыйРежимРДУ()
	
	Если Не ДополнительныеСвойства.Свойство("МассовоеСозданиеППРозничногоДУ") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДополнительныеСвойства.МассовоеСозданиеППРозничногоДУ <> Истина Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если Не ЭтоНовый() Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.Поручение") Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ДокументОснование.ВидОперации <> Перечисления.ВидыОперацийПоручение.Перевод Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

// IMDEV-9101
// Описание: Записывает статус объекта в ИсторияСтатусовОбъектов без предварительного чтения среза.
//
// Параметры:
//  ОбъектСсылка - ЛюбаяСсылка - объект регистра
//  НовыйСтатус - ПеречислениеСсылка.СтатусыОбъектов - статус для записи
//  ПериодЗаписи - Дата - период записи регистра
//
Процедура IMDEV9101_ЗаписатьСтатусБезЧтения(ОбъектСсылка, НовыйСтатус, ПериодЗаписи)
	
	Если Не ЗначениеЗаполнено(ОбъектСсылка) Тогда
		Возврат;
	КонецЕсли;
	
	МенеджерЗаписи = РегистрыСведений.ИсторияСтатусовОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ПериодЗаписи;
	МенеджерЗаписи.Объект = ОбъектСсылка;
	МенеджерЗаписи.Статус = НовыйСтатус;
	МенеджерЗаписи.Установил = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Записать();
	
КонецПроцедуры

// IMDEV-9101
// Описание: Пишет статусы Поручения и ПП при массовом создании без Q3-Q5.
//
// Параметры:
//  НовыйСтатусПП - ПеречислениеСсылка.СтатусыОбъектов - целевой статус ПП
//  Отказ - Булево - признак отказа записи
//  ТекстОтказа - Строка - текст ошибки
//
Процедура IMDEV9101_СохранитьСтатусыПриМассовомСоздании(НовыйСтатусПП, Отказ, ТекстОтказа)
	
	ПериодПП = Дата;
	Если Не ЗначениеЗаполнено(ПериодПП) Тогда
		ПериодПП = ТекущаяДатаСеанса();
	КонецЕсли;
	
	// W1: Поручение -> СформированоПлатежноеПоручение (для перехода из КОплате)
	Если НовыйСтатусПП = Перечисления.СтатусыОбъектов.КОплате
		И ЗначениеЗаполнено(ДокументОснование) Тогда
		
		// +1 сек без чтения среза: не перезаписать статус Новый в ту же секунду (контур A)
		ПериодОснования = Макс(ТекущаяДатаСеанса(), ПериодПП) + 1;
		
		Попытка
			IMDEV9101_ЗаписатьСтатусБезЧтения(
				ДокументОснование,
				Перечисления.СтатусыОбъектов.СформированоПлатежноеПоручение,
				ПериодОснования);
		Исключение
			ТекстОтказа = НСтр("ru = 'Не удалось изменить статус документа %1 по причине: %2'");
			ТекстОтказа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				ТекстОтказа, ДокументОснование, ОписаниеОшибки());
			Отказ = Истина;
			Возврат;
		КонецПопытки;
		
	КонецЕсли;
	
	// W2: ПП -> КОплате (или иной НовыйСтатус)
	Попытка
		IMDEV9101_ЗаписатьСтатусБезЧтения(Ссылка, НовыйСтатусПП, ПериодПП);
	Исключение
		ТекстОтказа = НСтр("ru = 'Не удалось изменить статус документа %1 по причине: %2'");
		ТекстОтказа = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
			ТекстОтказа, Ссылка, ОписаниеОшибки());
		Отказ = Истина;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытий

// IMDEV-9101
&ИзменениеИКонтроль("ПередЗаписью")
Процедура IMDEV9101_ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	// TM-3210
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли;
	
	/////////////////////////////////////////////////////////////////////////
	// ДОЗАПОЛНЕНИЕ
	
	// Дозаполняем статус. TM-3388 ----
	#Вставка
	// IMDEV-9101: массовый режим РДУ — без чтения статуса ПП (Q1)
	Если IMDEV9101_ЭтоМассовыйРежимРДУ() Тогда
		ТекущийСтатус = Перечисления.СтатусыОбъектов.ПустаяСсылка();
	Иначе
	#КонецВставки
	ТекущийСтатус 	= РегистрыСведений.ИсторияСтатусовОбъектов.ПолучитьАктуальныйСтатусОбъекта(Ссылка);
	#Вставка
	КонецЕсли;
	#КонецВставки
	НовыйСтатус		= ТекущийСтатус;
	Если ПометкаУдаления = Истина ИЛИ РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения Тогда
		НовыйСтатус = Перечисления.СтатусыОбъектов.Отменен;
		
	ИначеЕсли НЕ ЗначениеЗаполнено(ТекущийСтатус) 
		ИЛИ (Ссылка.Проведен = Ложь И РежимЗаписи = РежимЗаписиДокумента.Проведение)  
		ИЛИ (Ссылка.ПометкаУдаления = Истина И ПометкаУдаления = Ложь)  Тогда
		НовыйСтатус = Перечисления.СтатусыОбъектов.КОплате;
		
	КонецЕсли; 
	ДополнительныеСвойства.Вставить("ПредыдущийСтатус", ТекущийСтатус);		
	ДополнительныеСвойства.Вставить("НовыйСтатус", НовыйСтатус);
	#Вставка
	// IMDEV-9101
	Если IMDEV9101_ЭтоМассовыйРежимРДУ() Тогда
		ДополнительныеСвойства.Вставить("IMDEV9101_МассовыйРежимСтатусов", Истина);
	КонецЕсли;
	#КонецВставки
	// ---- TM-3388
	
	
	Если ПеречислениеВБюджет Тогда
		ВалютаДокумента = ОбщегоНазначенияДУ.ВалютаРеглУчета(ДоговорДУ);
		
		Если СчетДоговораДУ.ВалютаДенежныхСредств <> ВалютаДокумента Тогда
			СчетДоговораДУ = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;
		Если СчетКонтрагента.ВалютаДенежныхСредств <> ВалютаДокумента Тогда
			СчетКонтрагента = Справочники.БанковскиеСчета.ПустаяСсылка();
		КонецЕсли;		
		
	КонецЕсли;
	
	
	//////////////////////////////////////////
	// ПРОВЕРКИ ПРИ ЗАПИСИ
	
	Если ЭтоНовый() И ТипЗнч(ДокументОснование) <> Тип("ДокументСсылка.НачислениеПроцентовОтСреднейСЧА") Тогда
		
		// TM-3447 ----  ПП создаем только на основании документов со статусом Новый
		Если ЗначениеЗаполнено(ДокументОснование) Тогда
			#Вставка
			// IMDEV-9101: в массовом режиме статус основания берём из флага (без Q2)
			Если ДополнительныеСвойства.Свойство("IMDEV9101_МассовыйРежимСтатусов")
				И ДополнительныеСвойства.IMDEV9101_МассовыйРежимСтатусов = Истина Тогда
				
				СтатусОснования = Перечисления.СтатусыОбъектов.Новый;
				Если ДополнительныеСвойства.Свойство("СтатусОснованияИзвестен") Тогда
					СтатусОснования = ДополнительныеСвойства.СтатусОснованияИзвестен;
				КонецЕсли;
				
			Иначе
			#КонецВставки
			СтатусОснования 	= РегистрыСведений.ИсторияСтатусовОбъектов.ПолучитьАктуальныйСтатусОбъекта(ДокументОснование);
			#Вставка
			КонецЕсли;
			#КонецВставки
			Если СтатусОснования <> Перечисления.СтатусыОбъектов.Новый Тогда
				ТекстСообщения =  НСтр("ru='Платежное поручение можно создать только на основании объекта со статусом ""Новый""'");
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
				Возврат;			
			КонецЕсли; 	
		КонецЕсли;// ---- TM-3447
				
	КонецЕсли;
	
	Если НЕ ПараметрыСеанса.ВыполняютсяРегламентныеЗадания Тогда
		
		// ASP-26105 проверка блокировки договора ДУ
		Если ЗначениеЗаполнено(ДоговорДУ) И НЕ ПеречислениеВБюджет Тогда
			Блокировка = ОбщегоНазначения.ПолучитьЗначениеРеквизита(ДоговорДУ, "Блокировка");
			Если ЗначениеЗаполнено(Блокировка) 
				И (Блокировка = Перечисления.ВидыБлокировокДоговораДУ.ПолнаяБлокировка 
				ИЛИ Блокировка = Перечисления.ВидыБлокировокДоговораДУ.ЧастичнаяБлокировка 
				И ЗначениеЗаполнено(ДокументОснование)
				И ТипЗнч(ДокументОснование) = Тип("ДокументСсылка.Поручение")
				И ДокументОснование.ВидОперации = Перечисления.ВидыОперацийПоручение.ВыводИзДУ) Тогда
				
				ТекстСообщения = СтрШаблон("Договор: %1 заблокирован, обратитесь в Комплаенс.", ДоговорДУ);
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,ДоговорДУ,,,Отказ);
			    Возврат;
			КонецЕсли;
		КонецЕсли;

		
		// Запрет на создание новых ПП с незаполненным документом-основанием
		Если Не ЗначениеЗаполнено(БизнесПроцесс) И Не ЗначениеЗаполнено(ДокументОснование) Тогда  //НЕ РольДоступна("ПолныеПрава")	И
			ТекстСообщения =  НСтр("ru='Невозможно создать документ с незаполненным основанием
			|Должно быть заполнено поле ""Бизнес-процесс"" или ""Документ-основание""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		// TM-3440, ASP-139840 {
		Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("СпециалистБэкОфиса") И ПометкаУдаления = Ложь И Ссылка.ПометкаУдаления = Истина Тогда
			ТекстСообщения =  НСтр("ru='Недостаточно прав. Снимать пометку на удаление могут только пользователи с ролью ""Полные права""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("СпециалистБэкОфиса") И ЗначениеЗаполнено(БизнесПроцесс) И ПометкаУдаления = Истина И Ссылка.ПометкаУдаления = Ложь Тогда
			ТекстСообщения =  НСтр("ru='Недостаточно прав. Если платежное поручение создано в рамках бизнес-процесса,
			|то устанавливать пометку на удаление могут только пользователи с ролью ""Полные права""'");
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли;
		
		Если НЕ РольДоступна("ПолныеПрава") И НЕ РольДоступна("СпециалистБэкОфиса") И НЕ ЗначениеЗаполнено(БизнесПроцесс)
			И (ТекущийСтатус = Перечисления.СтатусыОбъектов.Выгружено ИЛИ ТекущийСтатус = Перечисления.СтатусыОбъектов.Исполнено)
			И (ПометкаУдаления = Истина Или РежимЗаписи = РежимЗаписиДокумента.ОтменаПроведения) Тогда
			ТекстСообщения = НСтр("ru='Невозможно отменить проведение документа. Платежное поручение находится в статусе ""%1""'");
			ТекстСообщения = СтрШаблон(ТекстСообщения, ТекущийСтатус);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения,,,,Отказ);
			Возврат;
		КонецЕсли; // }
		
	КонецЕсли;
	
	
КонецПроцедуры

// IMDEV-9101
&ИзменениеИКонтроль("ПриЗаписи")
Процедура IMDEV9101_ПриЗаписи(Отказ)
	
	Если Отказ Тогда Возврат КонецЕсли;
	
	// Записываем статус документа TM-3388 ----
	ПредыдущийСтатус = Неопределено;
	НовыйСтатус = Неопределено;
	ДополнительныеСвойства.Свойство("ПредыдущийСтатус", ПредыдущийСтатус);
	ДополнительныеСвойства.Свойство("НовыйСтатус", НовыйСтатус);
	
	// TM-3440 ----
	ТекстОтказа = "";
	Если  НовыйСтатус <> ПредыдущийСтатус Тогда
		#Вставка
		// IMDEV-9101: массовый режим — прямые W1/W2 без Q3-Q5
		Если ДополнительныеСвойства.Свойство("IMDEV9101_МассовыйРежимСтатусов")
			И ДополнительныеСвойства.IMDEV9101_МассовыйРежимСтатусов = Истина Тогда
			
			IMDEV9101_СохранитьСтатусыПриМассовомСоздании(НовыйСтатус, Отказ, ТекстОтказа);
			Если Отказ Тогда
				ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОтказа,,,,Отказ);
			КонецЕсли;
			
		Иначе
		#КонецВставки
		РегистрыСведений.ИсторияСтатусовОбъектов.ИзменитьСтатусДокОснованияПриИзмененииСтатусаПлатежногоПоручения(Ссылка, НовыйСтатус, Отказ, ,ТекстОтказа);
		Если НЕ Отказ Тогда
			РегистрыСведений.ИсторияСтатусовОбъектов.СохранитьТекущийСтатусОбъекта(Ссылка, НовыйСтатус);	
		Иначе
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстОтказа,,,,Отказ);
		КонецЕсли;
		#Вставка
		КонецЕсли;
		#КонецВставки
	КонецЕсли; 
	// ---- TM-3440
	// ---- TM-3388
	
КонецПроцедуры

#КонецОбласти
